import React from "react";
import FadeIn from "../components/FadeIn";

const AboutPage = () => {
  return (
    <div className="max-w-4xl mx-auto p-6">
      <FadeIn className="mb-10" delay={0.2} duration={0.8}>
      <h1 className="text-3xl font-bold mb-4">За Нас</h1>
      <p className="mb-4">
        Добредојдовте во F1 Shop – онлајн дестинација за сите вистински љубители на Формула 1! 
        Нашата платформа е создадена со страст и ентузијазам кон моторспортот, со цел да понудиме 
        уникатно искуство за навивачите од целиот свет.
      </p>
      <p className="mb-4">
        Кај нас ќе најдете внимателно селектирана колекција на оригинални и инспирирани производи: 
        маици, капи, кациги, комбинезони, патики и уште многу повеќе – од омилените тимови и возачи во F1. 
        Секој производ е избран со внимание за да го задоволи вкусот на вистинските фанови.
      </p>
      <p className="mb-4">
        Нашата мисија е да изградиме заедница каде што секој навивач ќе може да се поврзе со спортот кој го сака – 
        преку производи што носат гордост, припадност и страст. Без разлика дали си фраер за Red Bull, 
        верен на Ferrari или фан на легендите како Hamilton и Verstappen – тука ќе се пронајдеш!
      </p>
      <p className="mb-4">
        Ви благодариме што сте дел од нашата приказна. Вашата поддршка ни овозможува да продолжиме да растеме 
        и да нудиме уште подобри производи и услуги.
      </p>
      <p className="font-semibold">
        Се гледаме на патеката! 🏁
      </p>
      </FadeIn>
    </div>
  );
};

export default AboutPage;
